In [1]:
import pandas as pd
import numpy as np

In [2]:
# Reading CSV with Pandas is super easy
chicago = pd.read_csv('data/chicago-salaries.csv')
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$88968.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$80778.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$80778.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$84780.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$104736.00

In [3]:
# We can use a subset of the columns
no_title = pd.read_csv('data/chicago-salaries.csv', usecols=['Name', 'Department', 'Employee Annual Salary'])
no_title.head()

                  Name        Department Employee Annual Salary
0      AARON,  ELVIA J       WATER MGMNT              $88968.00
1    AARON,  JEFFERY M            POLICE              $80778.00
2       AARON,  KARINA            POLICE              $80778.00
3  AARON,  KIMBERLEI R  GENERAL SERVICES              $84780.00
4  ABAD JR,  VICENTE M       WATER MGMNT             $104736.00

In [8]:
# We can use different column names
# Specify index of header row to replace them with our names
our_column_names = pd.read_csv('data/chicago-salaries.csv', header=0, names=['name', 'title', 'department', 'salary'])
our_column_names.head()

                  name                     title        department      salary
0      AARON,  ELVIA J          WATER RATE TAKER       WATER MGMNT   $88968.00
1    AARON,  JEFFERY M            POLICE OFFICER            POLICE   $80778.00
2       AARON,  KARINA            POLICE OFFICER            POLICE   $80778.00
3  AARON,  KIMBERLEI R  CHIEF CONTRACT EXPEDITER  GENERAL SERVICES   $84780.00
4  ABAD JR,  VICENTE M         CIVIL ENGINEER IV       WATER MGMNT  $104736.00

In [4]:
# Or we could both use a subset of columns and rename them
no_title = pd.read_csv('data/chicago-salaries.csv', usecols=['Name', 'Department', 'Employee Annual Salary'])
both = no_title.rename(columns={'Name': 'name', 'Department': 'dept', 'Employee Annual Salary': 'salary'})
both.head()

                  name              dept      salary
0      AARON,  ELVIA J       WATER MGMNT   $88968.00
1    AARON,  JEFFERY M            POLICE   $80778.00
2       AARON,  KARINA            POLICE   $80778.00
3  AARON,  KIMBERLEI R  GENERAL SERVICES   $84780.00
4  ABAD JR,  VICENTE M       WATER MGMNT  $104736.00

In [5]:
# We can also pass converters on columns
converted = pd.read_csv(
    'data/chicago-salaries.csv',
    converters={
        'Employee Annual Salary': lambda x: float(x.replace('$', ''))
    })
chicago = converted.rename(columns={'Name': 'name', 'Position Title': 'title', 'Department': 'dept', 'Employee Annual Salary': 'salary'})
chicago.head()

                  name                     title              dept  salary
0      AARON,  ELVIA J          WATER RATE TAKER       WATER MGMNT   88968
1    AARON,  JEFFERY M            POLICE OFFICER            POLICE   80778
2       AARON,  KARINA            POLICE OFFICER            POLICE   80778
3  AARON,  KIMBERLEI R  CHIEF CONTRACT EXPEDITER  GENERAL SERVICES   84780
4  ABAD JR,  VICENTE M         CIVIL ENGINEER IV       WATER MGMNT  104736

In [6]:
# Remember the tally method? Pandas makes it easy
chicago['dept'].value_counts()

POLICE                   13570
FIRE                      4875
STREETS & SAN             2090
WATER MGMNT               1848
AVIATION                  1344
TRANSPORTN                1200
OEMC                      1135
PUBLIC LIBRARY             951
GENERAL SERVICES           924
FAMILY & SUPPORT           679
FINANCE                    560
HEALTH                     555
LAW                        425
CITY COUNCIL               397
BUILDINGS                  257
COMMUNITY DEVELOPMENT      212
BUSINESS AFFAIRS           173
BOARD OF ELECTION          111
DoIT                       106
MAYOR'S OFFICE              93
IPRA                        83
CITY CLERK                  82
PROCUREMENT                 81
CULTURAL AFFAIRS            79
HUMAN RESOURCES             68
ANIMAL CONTRL               67
INSPECTOR GEN               54
BUDGET & MGMT               43
ADMIN HEARNG                39
DISABILITIES                27
TREASURER                   24
HUMAN RELATIONS             17
BOARD OF ETHICS              9
POLICE BOARD                 2
LICENSE APPL COMM            1
Name: dept, dtype: int64